Here it is simple configuration for clean CF zone WAF setup:

```
% ls
main.tf

% cat main.tf 
terraform {
  required_providers {
    cloudflare = {
      source  = "registry.terraform.io/cloudflare/cloudflare"
      version = "4.45.0"
    }
  }

  backend "http" {

  }
}

provider "cloudflare" {
  api_token = "API-TOKEN"
}

resource "cloudflare_ruleset" "custom_rules_builder" {
  name = "Custom rules"
  kind = "zone"
  description = "Zone custom rules created by Terraform"
  zone_id = "ZONE-ID"
  phase = "http_request_firewall_custom"

  rules {
    expression  = "(cf.bot_management.verified_bot)"
    description = "Verified Bots"
    action      = "skip"
    action_parameters {
      ruleset  = "current"
    }
  }
}

% terraform apply
cloudflare_ruleset.custom_rules_builder: Refreshing state... [id=ID-HIDEN]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with
the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_ruleset.custom_rules_builder will be created
  + resource "cloudflare_ruleset" "custom_rules_builder" {
      + description = "Zone custom rules created by Terraform"
      + id          = (known after apply)
      + kind        = "zone"
      + name        = "Custom rules"
      + phase       = "http_request_firewall_custom"
      + zone_id     = "ZONE-ID"

      + rules {
          + action       = "skip"
          + description  = "Verified Bots"
          + enabled      = true
          + expression   = "(cf.bot_management.verified_bot)"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + ruleset = "current"
              + version = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_ruleset.custom_rules_builder: Creating...
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to cloudflare_ruleset.custom_rules_builder, provider
│ "provider[\"registry.terraform.io/cloudflare/cloudflare\"]" produced an unexpected new value: .rules[0].logging:
│ block count changed from 0 to 1.
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```